# DateTime Operation
- It is very important operation for time series analysis

In [5]:
import numpy as np
import pandas as pd

### Create or change type of DateTime
- .to_datetime()

In [6]:
data = {
    'Date': ['2023-01-01 10:12:15',
             '2023-01-02 11:12:13', '2023-01-03 11:12:13', '2023-01-04 11:12:13'],
    'Sales': [40000,50000, 35000, 55000]
}
df = pd.DataFrame(data)
df

                  Date  Sales
0  2023-01-01 10:12:15  40000
1  2023-01-02 11:12:13  50000
2  2023-01-03 11:12:13  35000
3  2023-01-04 11:12:13  55000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    4 non-null      object
 1   Sales   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [8]:
df.Date = pd.to_datetime(df.Date)

In [9]:
# date_range(start, end, freq=)
new_date = pd.date_range('2023-01-01 0000:00:00', '2023-12-31 0000:00:00', freq='ME')

In [10]:
new_df = pd.DataFrame({'Entry_date' : new_date})
new_df

   Entry_date
0  2023-01-31
1  2023-02-28
2  2023-03-31
3  2023-04-30
4  2023-05-31
5  2023-06-30
6  2023-07-31
7  2023-08-31
8  2023-09-30
9  2023-10-31
10 2023-11-30
11 2023-12-31

### Extracting Date/Time components
.dt accessor

In [11]:
df['year'] = df.Date.dt.year

In [12]:
df['Month'] = df.Date.dt.month
df['Day'] = df.Date.dt.day
df['Hour'] = df.Date.dt.hour

In [13]:
df.Date.dt.weekday

0    6
1    0
2    1
3    2
Name: Date, dtype: int32

In [14]:
new_df['Month_Name']=new_df.Entry_date.dt.month_name()
new_df

   Entry_date Month_Name
0  2023-01-31    January
1  2023-02-28   February
2  2023-03-31      March
3  2023-04-30      April
4  2023-05-31        May
5  2023-06-30       June
6  2023-07-31       July
7  2023-08-31     August
8  2023-09-30  September
9  2023-10-31    October
10 2023-11-30   November
11 2023-12-31   December

In [15]:
zomato = pd.read_csv('zomato.csv', encoding='latin-1')
zomato.columns

Index(['Restaurant ID', 'Restaurant Name', 'Country Code', 'City', 'Address',
       'Locality', 'Locality Verbose', 'Longitude', 'Latitude', 'Cuisines',
       'Average Cost for two', 'Currency', 'Has Table booking',
       'Has Online delivery', 'Is delivering now', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [16]:
ipl = pd.read_csv('IPL Matches 2008-2020.csv', parse_dates=['date'])
ipl

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
811,1216547,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,NaN,Nitin Menon,PR Reiffel
812,1237177,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,NaN,CB Gaffaney,Nitin Menon
813,1237178,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,Royal Challengers Bangalore,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,NaN,PR Reiffel,S Ravi
814,1237180,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,NaN,PR Reiffel,S Ravi
815,1237181,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,NaN,CB Gaffaney,Nitin Menon

In [17]:
ipl['year']=ipl.date.dt.year
ipl['month'] = ipl.date.dt.month
ipl['day'] = ipl.date.dt.day

In [18]:
ipl.year.value_counts()

year
2013    76
2012    74
2011    73
2014    60
2010    60
2020    60
2019    60
2016    60
2018    60
2015    59
2017    59
2008    58
2009    57
Name: count, dtype: int64

In [19]:
ipl.date.dt.month_name().value_counts()

date
April        364
May          349
March         41
October       40
September     12
November       8
June           2
Name: count, dtype: int64

In [20]:
df.Date.dt.minute

0    12
1    12
2    12
3    12
Name: Date, dtype: int32

In [21]:
df.Date.dt.second

0    15
1    13
2    13
3    13
Name: Date, dtype: int32

In [22]:
ipl.groupby('year')['result_margin'].mean()

year
2008    15.965517
2009    16.857143
2010    19.762712
2011    18.930556
2012    16.229730
2013    19.837838
2014    14.728814
2015    17.821429
2016    15.333333
2017    17.103448
2018    14.350000
2019    15.210526
2020    22.589286
Name: result_margin, dtype: float64

### Date/Time Arithmetic
- Perform calculations like adding/subtracting time or computing difference.
- Add/Subtract time : use pd.Timedelta or direct arithmetic

In [23]:
df['date_after_2days'] = df.Date + pd.Timedelta('2 days 3 hours 15 minutes')
df

                 Date  Sales  year  Month  Day  Hour    date_after_2days
0 2023-01-01 10:12:15  40000  2023      1    1    10 2023-01-03 13:27:15
1 2023-01-02 11:12:13  50000  2023      1    2    11 2023-01-04 14:27:13
2 2023-01-03 11:12:13  35000  2023      1    3    11 2023-01-05 14:27:13
3 2023-01-04 11:12:13  55000  2023      1    4    11 2023-01-06 14:27:13

Time differences : subtract datetime columns to get time deltas

In [24]:
df['time_diff']=df.date_after_2days - df.Date
df

,Date,Sales,year,Month,Day,Hour,date_after_2days,time_diff
0,2023-01-01 10:12:15,40000,2023,1,1,10,2023-01-03 13:27:15,2 days 03:15:00
1,2023-01-02 11:12:13,50000,2023,1,2,11,2023-01-04 14:27:13,2 days 03:15:00
2,2023-01-03 11:12:13,35000,2023,1,3,11,2023-01-05 14:27:13,2 days 03:15:00
3,2023-01-04 11:12:13,55000,2023,1,4,11,2023-01-06 14:27:13,2 days 03:15:00

In [25]:
df.time_diff.dt.days

0    2
1    2
2    2
3    2
Name: time_diff, dtype: int64

create date by range method

In [26]:
pd.DataFrame({
    'date': pd.date_range(start='2023-01-01', end='2023-12-31', periods=5)
})

        date
0 2023-01-01
1 2023-04-02
2 2023-07-02
3 2023-10-01
4 2023-12-31

# filtering by date/time
- filter rows based on date conditions

In [27]:
df

,Date,Sales,year,Month,Day,Hour,date_after_2days,time_diff
0,2023-01-01 10:12:15,40000,2023,1,1,10,2023-01-03 13:27:15,2 days 03:15:00
1,2023-01-02 11:12:13,50000,2023,1,2,11,2023-01-04 14:27:13,2 days 03:15:00
2,2023-01-03 11:12:13,35000,2023,1,3,11,2023-01-05 14:27:13,2 days 03:15:00
3,2023-01-04 11:12:13,55000,2023,1,4,11,2023-01-06 14:27:13,2 days 03:15:00

In [28]:
df[df.Date > '2023-01-01 10:12:16']

,Date,Sales,year,Month,Day,Hour,date_after_2days,time_diff
1,2023-01-02 11:12:13,50000,2023,1,2,11,2023-01-04 14:27:13,2 days 03:15:00
2,2023-01-03 11:12:13,35000,2023,1,3,11,2023-01-05 14:27:13,2 days 03:15:00
3,2023-01-04 11:12:13,55000,2023,1,4,11,2023-01-06 14:27:13,2 days 03:15:00

In [29]:
# extract records of April months through overall season.
ipl[4 == ipl.date.dt.month]

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2,year,month,day
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen,2008,4,18
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri,2008,4,19
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar,2008,4,19
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper,2008,4,20
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan,2008,4,20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
740,1178420,Jaipur,2019-04-27,JD Unadkat,Sawai Mansingh Stadium,0,Rajasthan Royals,Sunrisers Hyderabad,Rajasthan Royals,field,Rajasthan Royals,wickets,7.0,N,NaN,YC Barde,A Nand Kishore,2019,4,27
741,1178421,Delhi,2019-04-28,S Dhawan,Feroz Shah Kotla,0,Delhi Capitals,Royal Challengers Bangalore,Delhi Capitals,bat,Delhi Capitals,runs,16.0,N,NaN,KN Ananthapadmanabhan,BNJ Oxenford,2019,4,28
742,1178422,Kolkata,2019-04-28,AD Russell,Eden Gardens,0,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,field,Kolkata Knight Riders,runs,34.0,N,NaN,IJ Gould,Nitin Menon,2019,4,28
743,1178423,Hyderabad,2019-04-29,DA Warner,"Rajiv Gandhi International Stadium, Uppal",0,Sunrisers Hyderabad,Kings XI Punjab,Kings XI Punjab,field,Sunrisers Hyderabad,runs,45.0,N,NaN,CK Nandan,S Ravi,2019,4,29
744,1178424,Bengaluru,2019-04-30,NaN,M.Chinnaswamy Stadium,0,Royal Challengers Bangalore,Rajasthan Royals,Rajasthan Royals,field,NaN,NaN,NaN,NaN,NaN,UV Gandhe,NJ Llong,2019,4,30

Resampling and Aggregation
- handle time series data by resampling(eg: daily to monthly)
- common frequencies: 'D'(day), 'W'(week), 'ME'(month-end), 'YE'(year-end)
- aggregation methods : mean(), sum(), max() etc.

In [30]:
date_df = pd.DataFrame({
    'date': pd.date_range('2023-01-01', periods=10, freq= 'D'),
    'value': range(10,101, 10)
})
date_df.set_index('date', inplace=True)
date_df

            value
date
2023-01-01     10
2023-01-02     20
2023-01-03     30
2023-01-04     40
2023-01-05     50
2023-01-06     60
2023-01-07     70
2023-01-08     80
2023-01-09     90
2023-01-10    100

In [31]:
# resample to monthly average
date_df.resample('W').mean()

            value
date
2023-01-01   10.0
2023-01-08   50.0
2023-01-15   95.0

# Handling time zones
Pandas supports time zone-aware datetime objects.
- assign a time zone : use tz_localize()

In [32]:
df.Date = df.Date.dt.tz_localize('UTC+05:45')

In [33]:
df

,Date,Sales,year,Month,Day,Hour,date_after_2days,time_diff
0,2023-01-01 10:12:15+05:45,40000,2023,1,1,10,2023-01-03 13:27:15,2 days 03:15:00
1,2023-01-02 11:12:13+05:45,50000,2023,1,2,11,2023-01-04 14:27:13,2 days 03:15:00
2,2023-01-03 11:12:13+05:45,35000,2023,1,3,11,2023-01-05 14:27:13,2 days 03:15:00
3,2023-01-04 11:12:13+05:45,55000,2023,1,4,11,2023-01-06 14:27:13,2 days 03:15:00

- convert time zone : use tz_convert('define timezone')

In [34]:
df.Date.dt.tz_convert('America/New_York')

0   2022-12-31 23:27:15-05:00
1   2023-01-02 00:27:13-05:00
2   2023-01-03 00:27:13-05:00
3   2023-01-04 00:27:13-05:00
Name: Date, dtype: datetime64[ns, America/New_York]

In [35]:
df.Date.dt.tz_convert('Europe/Berlin')

0   2023-01-01 05:27:15+01:00
1   2023-01-02 06:27:13+01:00
2   2023-01-03 06:27:13+01:00
3   2023-01-04 06:27:13+01:00
Name: Date, dtype: datetime64[ns, Europe/Berlin]

# Handling Missing Dates
- fill or interprate missing dates in a time series.
- reindex to include all dates

In [36]:
df1 = pd.DataFrame({
    'date': pd.to_datetime(['2023-01-01', '2023-01-03']),
    'value': [42,50]
})
df1

        date  value
0 2023-01-01     42
1 2023-01-03     50

In [37]:
all_dates = pd.date_range('2023-01-01', '2023-01-03', freq='D')
df1.set_index('date').reindex(all_dates)

            value
2023-01-01   42.0
2023-01-02    NaN
2023-01-03   50.0

In [38]:
df1 = pd.DataFrame({
    'date_str': ['2025-10-18', 'invalid', '2025-10-20']
})
df1.dtypes

date_str    object
dtype: object

In [39]:
pd.to_datetime(df1.date_str, errors='coerce')

0   2025-10-18
1          NaT
2   2025-10-20
Name: date_str, dtype: datetime64[ns]

# Show different formats

In [40]:
# Sample DataFrame with various date string formats
df = pd.DataFrame({
    'date_str': [
        '2025-09-02',              # ISO format
        '09/02/2025',             # US format
        '02-Sep-2025',            # Day-Month-Year
        '2025-09-02 12:05:00',    # Date and time
        '09/02/2025 12:05 PM',    # US format with AM/PM
        '2025-09-02 12:05:00+05:45'  # With timezone
    ]
})
df

                    date_str
0                 2025-09-02
1                 09/02/2025
2                02-Sep-2025
3        2025-09-02 12:05:00
4        09/02/2025 12:05 PM
5  2025-09-02 12:05:00+05:45

# convert to datetime

In [41]:
df['date'] = pd.to_datetime(df.date_str, format= 'mixed', utc=True)
df

                    date_str                      date
0                 2025-09-02 2025-09-02 00:00:00+00:00
1                 09/02/2025 2025-09-02 00:00:00+00:00
2                02-Sep-2025 2025-09-02 00:00:00+00:00
3        2025-09-02 12:05:00 2025-09-02 12:05:00+00:00
4        09/02/2025 12:05 PM 2025-09-02 12:05:00+00:00
5  2025-09-02 12:05:00+05:45 2025-09-02 06:20:00+00:00

In [42]:
df = pd.DataFrame({
    'date_str': ['02/03/2025', '04/05/2025']
})
df

     date_str
0  02/03/2025
1  04/05/2025

- assume day-first (DD/MM/YY)

In [43]:
pd.to_datetime(df.date_str, dayfirst=True)

0   2025-03-02
1   2025-05-04
Name: date_str, dtype: datetime64[ns]

In [44]:
pd.to_datetime(df.date_str)

0   2025-02-03
1   2025-04-05
Name: date_str, dtype: datetime64[ns]

# specify exact format

In [45]:
pd.to_datetime(df.date_str, format='%d/%m/%Y')

0   2025-03-02
1   2025-05-04
Name: date_str, dtype: datetime64[ns]